      ******************************************************************
      *   CICS PLURALSIGHT 'EMPLOYE APP'
      *      - APPLICATION CONSTANTS FOR PROGRAM 'ESONP'
      ******************************************************************
       01 APPLICATION-CONSTANTS.
          05 AC-MAP-NAME         PIC X(7) VALUE 'ESONM  '.
          05 AC-MAPSET-NAME      PIC X(7) VALUE 'ESONMAP'.
          05 AC-FILE-NAME        PIC X(7) VALUE 'EREGUSR'.